app/controllers/bookings_controller.rb

SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
---
  def new
    @training = Training.find(params[:training_id])

SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def show
    @training = Training.find(params[:training_id])
    @booking = Booking.find(params[:id])

SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
INSERT INTO "bookings" ("total_price", "created_at", "updated_at", "training_id", "user_id", "first_name", "phone_number", "e_mail") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = current_user
    @training = Training.find(params[:training_id])
    @booking = Booking.new(booking_params)
    @booking.training = @training
    @booking.total_price = total_price(@training)
    @booking.user = @user
    @booking.e_mail = email_booking
    @booking.save