app/controllers/trainings_controller.rb

SELECT "trainings".* FROM "trainings"
---
  def index
    @trainings = Training.all

SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @training = Training.find(params[:id])

INSERT INTO "trainings" ("title", "date", "start_at", "end_at", "description", "coach", "address", "title_address", "price", "participation", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @training = Training.new(training_params)
    # @training.save # Will raise ActiveModel::ForbiddenAttributesError
    if @training.save

SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
---
  def edit
    @training = Training.find(params[:id])

SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
UPDATE "trainings" SET "description" = $1, "updated_at" = $2 WHERE "trainings"."id" = $3  [["description", "Salut"], ["updated_at", "2023-02-18 08:44:46.113123"], ["id", 25]]
---
  def update
    @training = Training.find(params[:id])
    @training.update(training_params)

SELECT "trainings".* FROM "trainings" WHERE "trainings"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
DELETE FROM "trainings" WHERE "trainings"."id" = $1  [["id", 25]]
---
  def destroy
    @training = Training.find(params[:id])
    @training.destroy